Revit 2027 API
ElectricalDemandFactorDefinition.GetApplicableDemandFactor Method
 This method will return the applicable demand factor for the specified number of devices or load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetApplicableDemandFactor(
	double numberOrLoad
)
Public Function GetApplicableDemandFactor (
	numberOrLoad As Double
) As Double
public:
double GetApplicableDemandFactor(
	double numberOrLoad
)
member GetApplicableDemandFactor :
        numberOrLoad : float -> float
Parameters
numberOrLoad Double
 The number of devices or load for which the demand factor should be looked up.
Return Value
Double
 The applicable demand factor.
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace